Revit 2027 API
FabricationConfiguration.SetServicesToLoad Method
 Sets the services which are to be loaded or not next time reloadConfiguration is called. If a service is not included but is currently loaded then it will be unloaded then.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool SetServicesToLoad(
	IList<int> serviceIds
)
Public Function SetServicesToLoad (
	serviceIds As IList(Of Integer)
) As Boolean
public:
bool SetServicesToLoad(
	IList<int>^ serviceIds
)
member SetServicesToLoad :
        serviceIds : IList<int> -> bool
Parameters
serviceIds IList<Int32>
Return Value
Boolean
 Returns true if successful. May fail if any service currently loaded is not included and is in use so cannot be unloaded.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace